# Задание 1:
# Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

name = input("Введите свое имя >>> ")
family_name = (input("Введите свою фамилию >>> "))
age = int(input("Введите свой возраст >>>"))

print(name, family_name, age)
